In [6]:
import numpy as np
import pandas as pd

## Анализ данных по Титанику

In [2]:
df = pd.read_csv('C:/Users/Геннадий Варламов/OneDrive/Рабочий стол/Altan_2/data_analytics/data/titanic.csv')

In [4]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
df[['sex', 'alive']]

        sex alive
0      male    no
1    female   yes
2    female   yes
3    female   yes
4      male    no
..      ...   ...
886    male    no
887  female   yes
888  female    no
889    male   yes
890    male    no

[891 rows x 2 columns]

In [14]:
df.agg({'alive': 'count'})

alive    891
dtype: int64

In [15]:
df.shape

(891, 15)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [18]:
# удаление пустых значений
df1 = pd.DataFrame({
    'c0': {'r0': 100, 'r1': 200, 'r2': 300},
    'c1': {'r1': 200, 'r2': 300},
    'c2': {'r0': 100, 'r2': 300},
})

In [19]:
df1

     c0     c1     c2
r0  100    NaN  100.0
r1  200  200.0    NaN
r2  300  300.0  300.0

In [20]:
# удаление строк

In [21]:
df1.dropna() # удаляет всю строку независимо от NaN значений

     c0     c1     c2
r2  300  300.0  300.0

In [22]:
df1.dropna(axis=1)

     c0
r0  100
r1  200
r2  300

In [23]:
# замена пустых значений на другое значение

In [27]:
df1.fillna(0).head()

     c0     c1     c2
r0  100    0.0  100.0
r1  200  200.0    0.0
r2  300  300.0  300.0

In [26]:
# удаление строк по индексам

In [29]:
df1.drop(['r0', 'r1'])

     c0     c1     c2
r2  300  300.0  300.0

In [30]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## Очистка данных

In [51]:
df2 = df.drop(['deck', 'embarked', 'class', 'sibsp', 'parch', 'adult_male', 'alive'], axis=1)

In [52]:
df2.columns

Index(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone'],
      dtype='object')

In [53]:
df2.dropna(inplace=True)

In [54]:
df2.shape

(712, 8)

In [56]:
# проверка на дубликаты
df2.duplicated(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone']).sum()

38

In [57]:
# удаляем дубликаты

In [58]:
df2.drop_duplicates(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone'], inplace=True)
df2.shape

(674, 8)

## Анализ данных

In [64]:
num_surv = df2['survived'].sum()
num_surv

281

In [65]:
# процент выживаемости

In [67]:
281 / 674

0.4169139465875371

In [69]:
num_surv / df2.shape[0] * 100

41.69139465875371

In [70]:
# максимальный, минимальный, средний возрасты

In [71]:
df2['age'].max()

80.0

In [72]:
df2['age'].min()

0.42

In [73]:
df2['age'].mean()

29.752848664688425

In [74]:
# Значение столбца "survived" при условии 'age' == 0.42

In [88]:
mask = (df2['age'] <= 1.0) & (df2['age'] > 0.42)

In [95]:
df2.loc[mask]

     survived  pclass     sex   age      fare    who  embark_town  alone
78          1       2    male  0.83   29.0000  child  Southampton  False
164         0       3    male  1.00   39.6875  child  Southampton  False
172         1       3  female  1.00   11.1333  child  Southampton  False
183         1       2    male  1.00   39.0000  child  Southampton  False
305         1       1    male  0.92  151.5500  child  Southampton  False
381         1       3  female  1.00   15.7417  child    Cherbourg  False
386         0       3    male  1.00   46.9000  child  Southampton  False
469         1       3  female  0.75   19.2583  child    Cherbourg  False
755         1       2    male  0.67   14.5000  child  Southampton  False
788         1       3    male  1.00   20.5750  child  Southampton  False
827         1       2    male  1.00   37.0042  child    Cherbourg  False
831         1       2    male  0.83   18.7500  child  Southampton  False

In [96]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [90]:
# уникальные значения по столбцам

In [93]:
df2['embark_town'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown'], dtype=object)

In [97]:
df2.loc[386, ['embark_town', 'survived', 'pclass']] # прихотливая индексация

embark_town    Southampton
survived                 0
pclass                   3
Name: 386, dtype: object

## Group by

In [101]:
df2.groupby('survived')[['age', 'sex', 'pclass']].mean()

                age    pclass
survived
0         30.874046  2.478372
1         28.184769  1.871886

In [ ]:
# выяснить по классам агрегацию!!!